sys_bench/oci/fio/fio.12x.716gb/4k.rw50.fio.group.output
job1: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job2: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job3: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job4: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job5: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job6: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job7: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job8: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job9: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job10: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job11: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job12: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
fio-3.1
Starting 12 processes

job1: (groupid=0, jobs=12): err= 0: pid=28449: Mon May  6 01:16:59 2019
   read: IOPS=149k, BW=584MiB/s (612MB/s)(34.2GiB/60019msec)
    slat (usec): min=2, max=28523, avg=37.22, stdev=195.63
    clat (usec): min=1004, max=76261, avg=4489.84, stdev=2127.65
     lat (usec): min=1010, max=76265, avg=4527.14, stdev=2136.76
    clat percentiles (usec):
     |  1.00th=[ 2606],  5.00th=[ 3228], 10.00th=[ 3392], 20.00th=[ 3523],
     | 30.00th=[ 3654], 40.00th=[ 3752], 50.00th=[ 3884], 60.00th=[ 4113],
     | 70.00th=[ 4555], 80.00th=[ 4883], 90.00th=[ 5538], 95.00th=[ 7308],
     | 99.00th=[15401], 99.50th=[18220], 99.90th=[23462], 99.95th=[25822],
     | 99.99th=[33817]
   bw (  KiB/s): min=20032, max=57442, per=8.35%, avg=49897.35, stdev=3241.14, samples=1440
   iops        : min= 5008, max=14360, avg=12474.05, stdev=810.27, samples=1440
  write: IOPS=149k, BW=583MiB/s (612MB/s)(34.2GiB/60019msec)
    slat (usec): min=2, max=41442, avg=37.64, stdev=195.29
    clat (usec): min=951, max=97919, avg=11494.83, stdev=6731.03
     lat (usec): min=956, max=97924, avg=11532.56, stdev=6733.93
    clat percentiles (usec):
     |  1.00th=[ 3261],  5.00th=[ 3687], 10.00th=[ 4228], 20.00th=[ 5080],
     | 30.00th=[ 6259], 40.00th=[ 7898], 50.00th=[ 9765], 60.00th=[12125],
     | 70.00th=[14746], 80.00th=[17695], 90.00th=[21365], 95.00th=[23725],
     | 99.00th=[29230], 99.50th=[31851], 99.90th=[38536], 99.95th=[41681],
     | 99.99th=[51119]
   bw (  KiB/s): min=19928, max=57242, per=8.35%, avg=49873.39, stdev=3247.77, samples=1440
   iops        : min= 4982, max=14310, avg=12468.06, stdev=811.94, samples=1440
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=32.50%, 10=41.63%, 20=19.07%, 50=6.79%
  lat (msec)   : 100=0.01%
  cpu          : usr=5.23%, sys=15.43%, ctx=557295, majf=0, minf=3116
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=8968510,8965239,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200

Run status group 0 (all jobs):
   READ: bw=584MiB/s (612MB/s), 584MiB/s-584MiB/s (612MB/s-612MB/s), io=34.2GiB (36.7GB), run=60019-60019msec
  WRITE: bw=583MiB/s (612MB/s), 583MiB/s-583MiB/s (612MB/s-612MB/s), io=34.2GiB (36.7GB), run=60019-60019msec

Disk stats (read/write):
  sdc: ios=720913/718891, merge=1629/5578, ticks=1560326/6617161, in_queue=8179057, util=99.67%
  sdd: ios=735609/731876, merge=1739/5611, ticks=1591644/6840189, in_queue=8432910, util=99.92%
  sde: ios=758465/756190, merge=1683/6056, ticks=1591315/6744545, in_queue=8336935, util=99.89%
  sdf: ios=753592/749804, merge=1699/5952, ticks=1611181/6824851, in_queue=8438640, util=99.95%
  sdg: ios=753819/749125, merge=1634/5861, ticks=1604206/6822754, in_queue=8428166, util=99.96%
  sdh: ios=762617/759482, merge=1732/6120, ticks=1649271/6780379, in_queue=8432662, util=100.00%
  sdi: ios=755623/750858, merge=1631/5898, ticks=1601913/6735133, in_queue=8339411, util=100.00%
  sdb: ios=754185/748111, merge=1780/5823, ticks=1643331/6742144, in_queue=8387494, util=99.97%
  sdj: ios=754169/749221, merge=1616/5795, ticks=1600054/6747329, in_queue=8349932, util=100.00%
  sdk: ios=752724/748933, merge=1582/5739, ticks=1589861/6681239, in_queue=8274245, util=99.98%
  sdl: ios=721006/716646, merge=1559/5538, ticks=1535926/6413654, in_queue=7950592, util=99.52%
  sdm: ios=725891/722625, merge=1612/5571, ticks=1651005/6788116, in_queue=8441751, util=100.00%